Good evening @rchui 👋  ,

thank you for reporting the issue and also for the reproduction steps.
Based on your information I created below  configuration 

```hcl
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 5.98.0"
    }
  }
  required_version = "~> 1.12.2"
}

provider "aws" {
  region = "eu-central-1"
}

resource "aws_batch_compute_environment" "fargate_spot" {
  compute_environment_name_prefix = "fargate-spot-"
  state                           = "ENABLED"
  type                            = "MANAGED"

  compute_resources {
    max_vcpus          = 200
    security_group_ids = ["sg-01d26d755265acfc9"]
    subnets            = ["subnet-0b244e542f33c1b3a"]
    type               = "FARGATE_SPOT"
  }
}
```
and executed `terraform init` 

```shell
❯ terraform init
Initializing the backend...
Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.98.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

and then `terraform apply`


```shell
❯ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_batch_compute_environment.fargate_spot will be created
  + resource "aws_batch_compute_environment" "fargate_spot" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "fargate-spot-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = (known after apply)
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = (known after apply)
      + type                            = "MANAGED"

      + compute_resources {
          + desired_vcpus      = (known after apply)
          + max_vcpus          = 200
          + security_group_ids = [
              + "sg-01d26d755265acfc9",
            ]
          + subnets            = [
              + "subnet-0b244e542f33c1b3a",
            ]
          + type               = "FARGATE_SPOT"

          + ec2_configuration (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_batch_compute_environment.fargate_spot: Creating...
aws_batch_compute_environment.fargate_spot: Creation complete after 2s [id=fargate-spot-20250618193038108900000001]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```


I also had a look into the source code of the resource and noticed a changed mentioned for v6.0.0 of the provider

> resource/aws_batch_compute_environment: Rename compute_environment_name to name
> resource/aws_batch_compute_environment: Rename compute_environment_name_prefix to name_prefix (https://github.com/hashicorp/terraform-provider-aws/issues/38050)

You mentioned that you are using v5.98.0 of the provider - could it be that somehow v6.0.0 is already used?
Using this version I get same error message as you have:

```shell
❯ terraform init --upgrade
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 6.0.0"...
- Installing hashicorp/aws v6.0.0...
- Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
❯ 
❯ 
❯ terraform plan
╷
│ Error: Unsupported argument
│ 
│   on main.tf line 17, in resource "aws_batch_compute_environment" "fargate_spot":
│   17:   compute_environment_name_prefix = "fargate-spot-"
│ 
│ An argument named "compute_environment_name_prefix" is not expected here.
```
